smock-jaxws/cxf-server-test/src/test/resources/request-context-xslt.xml

<xsl:stylesheet xmlns:xsl="http://www.w3.org/1999/XSL/Transform" version="1.0">
	<xsl:param name="a" />
	<xsl:param name="b" />
	<xsl:template match="/">
		<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
			<soapenv:Header />
			<soapenv:Body>
				<plus xmlns="http://javacrumbs.net/calc">
					<a>
						<xsl:value-of select="$a" />
					</a>
					<b>
						<xsl:value-of select="$b" />
					</b>
				</plus>
			</soapenv:Body>
		</soapenv:Envelope>
	</xsl:template>
</xsl:stylesheet>
